huang1649/CC2530/ioCC2530.h
/*  USART 1 Control and Status                                                      */
 SFRBIT( U1CSR   ,  0xF8, U1MODE, U1RE, U1SLAVE, U1FE, U1ERR, U1RX_BYTE, U1TX_BYTE, U1ACTIVE )
SFR(  U1DBUF    ,  0xF9  )   /*  USART 1 Receive/Transmit Data Buffer               */
SFR(  U1BAUD    ,  0xFA  )   /*  USART 1 Baud Rate Control                          */
SFR(  U1UCR     ,  0xFB  )   /*  USART 1 UART Control                               */
SFR(  U1GCR     ,  0xFC  )   /*  USART 1 Generic Control                            */
SFR(  P0DIR     ,  0xFD  )   /*  Port 0 Direction                                   */
SFR(  P1DIR     ,  0xFE  )   /*  Port 1 Direction                                   */
SFR(  P2DIR     ,  0xFF  )   /*  Port 2 Direction                                   */


/* ------------------------------------------------------------------------------------------------
 *                                       Xdata Radio Registers
 * ------------------------------------------------------------------------------------------------
 */
/* RF Core RAM */
#define RFCORE_RAM      PXREG( 0x6000 )
#define RFCORE_RAM_SZ   384

/* FIFO Direct Access */
#define RXFIFO          PXREG( 0x6000 )
#define RXFIFO_SZ       128
#define TXFIFO          PXREG( 0x6080 )
#define TXFIFO_SZ       128

/* Frame Filtering and Source Matching Memory */
#define FRMF_SRCM_RAM   PXREG( 0x6100 )
#define FRMF_SRCM_RAM_SZ 128

/* Source Address Table */
#define SRC_ADDR_TABLE  PXREG( 0x6100 )
#define SRC_ADDR_TABLE_SZ 96

/* Source Address Matching Control */
#define SRCRESMASK0     XREG( 0x6160 )
#define SRCRESMASK1     XREG( 0x6161 )
#define SRCRESMASK2     XREG( 0x6162 )
#define SRCRESINDEX     XREG( 0x6163 )
#define SRCEXTPENDEN0   XREG( 0x6164 )
#define SRCEXTPENDEN1   XREG( 0x6165 )
#define SRCEXTPENDEN2   XREG( 0x6166 )
#define SRCSHORTPENDEN0 XREG( 0x6167 )
#define SRCSHORTPENDEN1 XREG( 0x6168 )
#define SRCSHORTPENDEN2 XREG( 0x6169 )

/* Local Address Information */
#define EXT_ADDR0       XREG( 0x616A )
#define EXT_ADDR1       XREG( 0x616B )
#define EXT_ADDR2       XREG( 0x616C )
#define EXT_ADDR3       XREG( 0x616D )
#define EXT_ADDR4       XREG( 0x616E )
#define EXT_ADDR5       XREG( 0x616F )
#define EXT_ADDR6       XREG( 0x6170 )
#define EXT_ADDR7       XREG( 0x6171 )
#define PAN_ID0         XREG( 0x6172 )
#define PAN_ID1         XREG( 0x6173 )
#define SHORT_ADDR0     XREG( 0x6174 )
#define SHORT_ADDR1     XREG( 0x6175 )

/* Address information for RX Control */
#define FRMFILT0        XREG( 0x6180 )
#define FRMFILT1        XREG( 0x6181 )
#define SRCMATCH        XREG( 0x6182 )
#define SRCSHORTEN0     XREG( 0x6183 )
#define SRCSHORTEN1     XREG( 0x6184 )
#define SRCSHORTEN2     XREG( 0x6185 )
#define SRCEXTEN0       XREG( 0x6186 )
#define SRCEXTEN1       XREG( 0x6187 )
#define SRCEXTEN2       XREG( 0x6188 )

/* Radio Control */
#define FRMCTRL0        XREG( 0x6189 )
#define FRMCTRL1        XREG( 0x618A )
#define RXENABLE        XREG( 0x618B )
#define RXMASKSET       XREG( 0x618C )
#define RXMASKCLR       XREG( 0x618D )
#define FREQTUNE        XREG( 0x618E )
#define FREQCTRL        XREG( 0x618F )
#define TXPOWER         XREG( 0x6190 )
#define TXCTRL          XREG( 0x6191 )
#define FSMSTAT0        XREG( 0x6192 )
#define FSMSTAT1        XREG( 0x6193 )
#define FIFOPCTRL       XREG( 0x6194 )
#define FSMCTRL         XREG( 0x6195 )
#define CCACTRL0        XREG( 0x6196 )
#define CCACTRL1        XREG( 0x6197 )
#define RSSI            XREG( 0x6198 )
#define RSSISTAT        XREG( 0x6199 )
#define RXFIRST         XREG( 0x619A )
#define RXFIFOCNT       XREG( 0x619B )
#define TXFIFOCNT       XREG( 0x619C )
#define RXFIRST_PTR     XREG( 0x619D )
#define RXLAST_PTR      XREG( 0x619E )
#define RXP1_PTR        XREG( 0x619F )
#define _XREG61A0       XREG( 0x61A0 )
#define TXFIRST_PTR     XREG( 0x61A1 )
#define TXLAST_PTR      XREG( 0x61A2 )

/* Interrupt Controller Registers */
#define RFIRQM0         XREG( 0x61A3 )
#define RFIRQM1         XREG( 0x61A4 )
#define RFERRM          XREG( 0x61A5 )

/* Random Number Generator */
#define RFRND           XREG( 0x61A7 )

/* Analog and Digital Radio Test And Tuning */
#define MDMCTRL0        XREG( 0x61A8 )
#define MDMCTRL1        XREG( 0x61A9 )
#define FREQEST         XREG( 0x61AA )
#define RXCTRL          XREG( 0x61AB )
#define FSCTRL          XREG( 0x61AC )
#define FSCAL0          XREG( 0x61AD )
#define FSCAL1          XREG( 0x61AE )
#define FSCAL2          XREG( 0x61AF )
#define FSCAL3          XREG( 0x61B0 )
#define AGCCTRL0        XREG( 0x61B1 )
#define AGCCTRL1        XREG( 0x61B2 )
#define AGCCTRL2        XREG( 0x61B3 )
#define AGCCTRL3        XREG( 0x61B4 )
#define ADCTEST0        XREG( 0x61B5 )
#define ADCTEST1        XREG( 0x61B6 )
#define ADCTEST2        XREG( 0x61B7 )
#define MDMTEST0        XREG( 0x61B8 )
#define MDMTEST1        XREG( 0x61B9 )
#define DACTEST0        XREG( 0x61BA )
#define DACTEST1        XREG( 0x61BB )
#define DACTEST2        XREG( 0x61BC )
#define ATEST           XREG( 0x61BD )
#define PTEST0          XREG( 0x61BE )
#define PTEST1          XREG( 0x61BF )
#define TXFILTCFG       XREG( 0x61FA )

/* CSP Control and Observation Registers */
#define CSPPROG0        XREG( 0x61C0 )
#define CSPPROG1        XREG( 0x61C1 )
#define CSPPROG2        XREG( 0x61C2 )
#define CSPPROG3        XREG( 0x61C3 )
#define CSPPROG4        XREG( 0x61C4 )
#define CSPPROG5        XREG( 0x61C5 )
#define CSPPROG6        XREG( 0x61C6 )
#define CSPPROG7        XREG( 0x61C7 )
#define CSPPROG8        XREG( 0x61C8 )
#define CSPPROG9        XREG( 0x61C9 )
#define CSPPROG10       XREG( 0x61CA )
#define CSPPROG11       XREG( 0x61CB )
#define CSPPROG12       XREG( 0x61CC )
#define CSPPROG13       XREG( 0x61CD )
#define CSPPROG14       XREG( 0x61CE )
#define CSPPROG15       XREG( 0x61CF )
#define CSPPROG16       XREG( 0x61D0 )
#define CSPPROG17       XREG( 0x61D1 )
#define CSPPROG18       XREG( 0x61D2 )
#define CSPPROG19       XREG( 0x61D3 )
#define CSPPROG20       XREG( 0x61D4 )
#define CSPPROG21       XREG( 0x61D5 )
#define CSPPROG22       XREG( 0x61D6 )
#define CSPPROG23       XREG( 0x61D7 )
#define _XREG61D8       XREG( 0x61D8 )
#define _XREG61D9       XREG( 0x61D9 )
#define _XREG61DA       XREG( 0x61DA )
#define _XREG61DB       XREG( 0x61DB )
#define _XREG61DC       XREG( 0x61DC )
#define _XREG61DD       XREG( 0x61DD )
#define _XREG61DE       XREG( 0x61DE )
#define _XREG61DF       XREG( 0x61DF )
#define CSPCTRL         XREG( 0x61E0 )
#define CSPSTAT         XREG( 0x61E1 )
#define CSPX            XREG( 0x61E2 )
#define CSPY            XREG( 0x61E3 )
#define CSPZ            XREG( 0x61E4 )
#define CSPT            XREG( 0x61E5 )
#define _XREG61E6       XREG( 0x61E6 )
#define _XREG61E7       XREG( 0x61E7 )
#define _XREG61E8       XREG( 0x61E8 )
#define _XREG61E9       XREG( 0x61E9 )
#define _XREG61EA       XREG( 0x61EA )


/* Observability Control */
#define RFC_OBS_CTRL0   XREG( 0x61EB )
#define RFC_OBS_CTRL1   XREG( 0x61EC )
#define RFC_OBS_CTRL2   XREG( 0x61ED )
#define OBSSEL0         XREG( 0x6243 )
#define OBSSEL1         XREG( 0x6244 )
#define OBSSEL2         XREG( 0x6245 )
#define OBSSEL3         XREG( 0x6246 )
#define OBSSEL4         XREG( 0x6247 )
#define OBSSEL5         XREG( 0x6248 )
#define TR0             XREG( 0x624B )

/* Chip Identification */
#define CHVER           XREG( 0x6249 )
#define CHIPID          XREG( 0x624A )

/* Debug Interface DMA Write to Flash */
#define DBGDATA         XREG( 0x6260 )

/* Flash Controller */
#define FCTL            XREG( 0x6270 )
#define FADDRL          XREG( 0x6271 )
#define FADDRH          XREG( 0x6272 )
#define FWDATA          XREG( 0x6273 )
#define _XREG6274       XREG( 0x6274 )
#define _XREG6275       XREG( 0x6275 )

/* Chip Information */
#define CHIPINFO0       XREG( 0x6276 )
#define CHIPINFO1       XREG( 0x6277 )

/* IR Generation Control */
#define IRCTL           XREG( 0x6281 )

/* Clock Loss Detector */
#define CLD             XREG( 0x6290 )

/* Timer 1 Channels (only mapped as XREG) */
#define T1CCTL3         XREG( 0x62A3 )
#define T1CCTL4         XREG( 0x62A4 )
#define T1CC3L          XREG( 0x62AC )
#define T1CC3H          XREG( 0x62AD )
#define T1CC4L          XREG( 0x62AE )
#define T1CC4H          XREG( 0x62AF )
/* Definition which includes channels represented in SFR (additional XREG mapping of SFR) */
#define XX_T1CCTL0      XREG( 0x62A0 )
#define XX_T1CCTL1      XREG( 0x62A1 )
#define XX_T1CCTL2      XREG( 0x62A2 )
#define XX_T1CCTL3      XREG( 0x62A3 )
#define XX_T1CCTL4      XREG( 0x62A4 )
#define XX_T1CC0L       XREG( 0x62A6 )
#define XX_T1CC0H       XREG( 0x62A7 )
#define XX_T1CC1L       XREG( 0x62A8 )
#define XX_T1CC1H       XREG( 0x62A9 )
#define XX_T1CC2L       XREG( 0x62AA )
#define XX_T1CC2H       XREG( 0x62AB )
#define XX_T1CC3L       XREG( 0x62AC )
#define XX_T1CC3H       XREG( 0x62AD )
#define XX_T1CC4L       XREG( 0x62AE )
#define XX_T1CC4H       XREG( 0x62AF )
/* Pointers for array access */
#define P_T1CCTL        PXREG( 0x62A0 )
#define P_T1CC          PXREG( 0x62A6 )

/* Sleep Timer Capture Control */
#define STCC            XREG( 0x62B0 )
#define STCS            XREG( 0x62B1 )
#define STCV0           XREG( 0x62B2 )
#define STCV1           XREG( 0x62B3 )
#define STCV2           XREG( 0x62B4 )

